In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv(r"c:\DATA SCIENCE\Machine_Learning\Linear Regression\Data_Sets\homeprices.csv")
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [7]:
df.shape

(13, 3)

In [4]:
df.isnull().sum()

town     0
area     0
price    0
dtype: int64

In [8]:
df.duplicated().sum()

np.int64(0)

In [6]:
df["town"].value_counts()

town
monroe township    5
west windsor       4
robinsville        4
Name: count, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()
df["town"]=encoder.fit_transform(df["town"])

In [11]:
df.head()

   town  area   price
0     0  2600  550000
1     0  3000  565000
2     0  3200  610000
3     0  3600  680000
4     0  4000  725000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   town    13 non-null     int64
 1   area    13 non-null     int64
 2   price   13 non-null     int64
dtypes: int64(3)
memory usage: 444.0 bytes

In [14]:
x=df[["town","area"]]
y=df["price"]
x

    town  area
0      0  2600
1      0  3000
2      0  3200
3      0  3600
4      0  4000
5      2  2600
6      2  2800
7      2  3300
8      2  3600
9      1  2600
10     1  2900
11     1  3100
12     1  3600

In [18]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=10,train_size=0.78)

In [22]:
from sklearn.tree import DecisionTreeRegressor
model=DecisionTreeRegressor()
model.fit(x_train,y_train)
y_predict=model.predict(x_test)
from sklearn.metrics import r2_score,mean_absolute_error,mean_squared_error
print(r2_score(y_test,y_predict))
print(mean_squared_error(y_test,y_predict))
print(mean_absolute_error(y_test,y_predict))

-1.2361111111111112
1341666666.6666667
35000.0

In [23]:
from sklearn.linear_model import LinearRegression
model1=LinearRegression()
model1.fit(x_train,y_train)
y_predict1=model1.predict(x_test)
print(r2_score(y_test,y_predict1))
print(mean_squared_error(y_test,y_predict1))
print(mean_absolute_error(y_test,y_predict1))

0.4397468126953946
336151912.3827632
16296.19577509386